Revit 2027 API
BuiltInFailures.ElectricalFailures.CircuitsOverlapDisconnectCircuits Property
 More than one circuit falls onto the same slot. These circuits will be disconnected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircuitsOverlapDisconnectCircuits { get; }
Public Shared ReadOnly Property CircuitsOverlapDisconnectCircuits As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircuitsOverlapDisconnectCircuits {
	FailureDefinitionId^ get ();
}
static member CircuitsOverlapDisconnectCircuits : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace